In [15]:
%pip install openpyxl

Requirement already satisfied: openpyxl in /home/zeeshan/miniconda3/envs/ml_env/lib/python3.12/site-packages (3.1.2)
Requirement already satisfied: et-xmlfile in /home/zeeshan/miniconda3/envs/ml_env/lib/python3.12/site-packages (from openpyxl) (1.1.0)

In [20]:
import pandas as pd
import seaborn as sns
# load data set 
kashti = sns.load_dataset("titanic")
# write a file 
kashti.to_excel("datasets/titanic.xlsx")

In [29]:
# how to read a file
import pandas as pd
df = pd.read_excel("datasets/titanic.xlsx")
df.info() # get info about data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 16 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Unnamed: 0   891 non-null    int64
 1   survived     891 non-null    int64
 2   pclass       891 non-null    int64
 3   sex          891 non-null    object
 4   age          714 non-null    float64
 5   sibsp        891 non-null    int64
 6   parch        891 non-null    int64
 7   fare         891 non-null    float64
 8   embarked     889 non-null    object
 9   class        891 non-null    object
 10  who          891 non-null    object
 11  adult_male   891 non-null    bool
 12  deck         203 non-null    object
 13  embark_town  889 non-null    object
 14  alive        891 non-null    object
 15  alone        891 non-null    bool
dtypes: bool(2), float64(2), int64(5), object(7)
memory usage: 99.3+ KB

In [31]:
df.head() # get top 5 records from data

,Unnamed: 0,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [44]:
# practice for https://pandas.pydata.org/docs/user_guide/10min.html
import numpy as np
values = np.random.randn(6, 5)
dates = pd.date_range(start="20130101",periods=6)

# Creating a DataFrame by passing a NumPy array with a datetime index using date_range() and labeled columns:
df = pd.DataFrame(data=values, index=dates, columns=list("ABCDE"))
df

                   A         B         C         D         E
2013-01-01  0.875143 -0.844341 -0.153011  0.846904 -0.289582
2013-01-02  0.492801  1.132055  0.810076 -0.665435  1.656668
2013-01-03 -0.412091  1.195663 -0.214946 -0.924033 -0.691862
2013-01-04 -0.185495  0.877542 -1.215900 -0.614657 -1.649769
2013-01-05  0.234804  1.390588  0.993869  1.712205  0.184397
2013-01-06  0.257352 -0.496829  1.167648 -0.176117  0.924259

#### creatign the DataFrame by passing a dictionary of objects where the keys are the column labels and the value are the column values

In [46]:
df2 = pd.DataFrame(
    {
        "A":1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)
df2.info()
df2.dtypes

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 0 to 3
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      float64
 1   B       4 non-null      datetime64[s]
 2   C       4 non-null      float32
 3   D       4 non-null      int32
 4   E       4 non-null      category
 5   F       4 non-null      object
dtypes: category(1), datetime64[s](1), float32(1), float64(1), int32(1), object(1)
memory usage: 288.0+ bytes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

#### Viewing data

In [50]:
df2.head(2) # fetch 2 result from the top of dtaframe

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo

In [51]:
df.tail(3) # fetch 3 records from bottom

                   A         B         C         D         E
2013-01-04 -0.185495  0.877542 -1.215900 -0.614657 -1.649769
2013-01-05  0.234804  1.390588  0.993869  1.712205  0.184397
2013-01-06  0.257352 -0.496829  1.167648 -0.176117  0.924259

#### Display the index , and column

In [54]:
df.index
df.columns

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

##### Return a NumPy representation of the underlying data with DataFrame.to_numpy() without the index or column labels:

In [57]:
df.to_numpy()

array([[ 0.87514337, -0.84434064, -0.15301088,  0.84690366, -0.28958212],
       [ 0.49280061,  1.13205477,  0.81007573, -0.66543518,  1.65666756],
       [-0.41209097,  1.19566304, -0.21494601, -0.92403331, -0.69186173],
       [-0.18549527,  0.87754246, -1.21589976, -0.61465721, -1.64976949],
       [ 0.23480427,  1.39058809,  0.99386925,  1.71220507,  0.18439662],
       [ 0.25735241, -0.49682853,  1.16764823, -0.17611747,  0.92425891]])

##### NumPy arrays have one dtype for the entire array while pandas DataFrames have one dtype per column. When you call DataFrame.to_numpy(), pandas will find the NumPy dtype that can hold all of the dtypes in the DataFrame. If the common data type is object, DataFrame.to_numpy() will require copying data.

In [58]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [59]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [67]:
df.head()

                   A         B         C         D         E
2013-01-01  0.875143 -0.844341 -0.153011  0.846904 -0.289582
2013-01-02  0.492801  1.132055  0.810076 -0.665435  1.656668
2013-01-03 -0.412091  1.195663 -0.214946 -0.924033 -0.691862
2013-01-04 -0.185495  0.877542 -1.215900 -0.614657 -1.649769
2013-01-05  0.234804  1.390588  0.993869  1.712205  0.184397

### describe() shows a quick statistic summary of your data:

In [63]:
df.describe()

              A         B         C         D         E
count  6.000000  6.000000  6.000000  6.000000  6.000000
mean   0.210419  0.542447  0.231289  0.029811  0.022352
std    0.462312  0.960129  0.920267  1.034314  1.175932
min   -0.412091 -0.844341 -1.215900 -0.924033 -1.649769
25%   -0.080420 -0.153236 -0.199462 -0.652741 -0.591292
50%    0.246078  1.004799  0.328532 -0.395387 -0.052593
75%    0.433939  1.179761  0.947921  0.591148  0.739293
max    0.875143  1.390588  1.167648  1.712205  1.656668

### Transposing your data:

In [65]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.875143    0.492801   -0.412091   -0.185495    0.234804    0.257352
B   -0.844341    1.132055    1.195663    0.877542    1.390588   -0.496829
C   -0.153011    0.810076   -0.214946   -1.215900    0.993869    1.167648
D    0.846904   -0.665435   -0.924033   -0.614657    1.712205   -0.176117
E   -0.289582    1.656668   -0.691862   -1.649769    0.184397    0.924259

### Sort Index

In [71]:
df.sort_index(axis=1, ascending=False)

                   E         D         C         B         A
2013-01-01 -0.289582  0.846904 -0.153011 -0.844341  0.875143
2013-01-02  1.656668 -0.665435  0.810076  1.132055  0.492801
2013-01-03 -0.691862 -0.924033 -0.214946  1.195663 -0.412091
2013-01-04 -1.649769 -0.614657 -1.215900  0.877542 -0.185495
2013-01-05  0.184397  1.712205  0.993869  1.390588  0.234804
2013-01-06  0.924259 -0.176117  1.167648 -0.496829  0.257352

## Selection
### 1) Getitem ([])
#### For a DataFrame, passing a single label selects a columns and yields a Series equivalent to df.A:

In [76]:
df["A"]

2013-01-01    0.875143
2013-01-02    0.492801
2013-01-03   -0.412091
2013-01-04   -0.185495
2013-01-05    0.234804
2013-01-06    0.257352
Freq: D, Name: A, dtype: float64

#### For a DataFrame, passing a slice : selects matching rows

In [77]:
df[0:3]

                   A         B         C         D         E
2013-01-01  0.875143 -0.844341 -0.153011  0.846904 -0.289582
2013-01-02  0.492801  1.132055  0.810076 -0.665435  1.656668
2013-01-03 -0.412091  1.195663 -0.214946 -0.924033 -0.691862

In [78]:
df["20130102":"20130104"]

                   A         B         C         D         E
2013-01-02  0.492801  1.132055  0.810076 -0.665435  1.656668
2013-01-03 -0.412091  1.195663 -0.214946 -0.924033 -0.691862
2013-01-04 -0.185495  0.877542 -1.215900 -0.614657 -1.649769

### 2) Selection by label
#### For label slicing, both endpoints are included: